{"data":{"site":{"siteMetadata":{"title":"Vorlume","author":"Salem Nzeukwu"}},"markdownRemark":{"id":"86325ecc-12fe-5519-a757-18dbe6c525b9","excerpt":"In the spirit of new year, I decided to take  Dan Abramov’s   advice  and start a blog as soon as possible, something I have procrastinated for so long. People…","html":"<p>In the spirit of new year, I decided to take <a href=\"https://twitter.com/dan_abramov\">Dan Abramov’s</a> <a href=\"https://twitter.com/dan_abramov/status/1079214023881707520\">advice</a> and start a blog as soon as possible, something I have procrastinated for so long.</p>\n<p>People have always asked me what they need to have in place before they can start learning how to code. So it makes sense to start this blog by outlining some prerequisite to learning to code.</p>\n<p>But before I do that, I want to clear two misconception that people tend to have about coding and learning how to code.</p>\n<ol>\n<li><strong>Codding is not hard:</strong> People always have this misconception that coding is hard. This is hardly true. Coding can be as easy as learning a new language. Yes, you may find it intimidating at first, but with time it will be second nature to you.</li>\n<li><strong>You don’t need anyone to teach you:</strong> I have seen many people who say they want to learn how to code, but they don’t actually put in any effort in trying to learn how to code, they just sit an wait for someone to come and teach them or until they attend a computer science lecture. This is wrong. You can learn how to code on your own.</li>\n</ol>\n<p>This is not to say that you shouldn’t attend a computer science lecture or get a private tutor to teach you to code. Do that if you can, it may even help you learn faster. But in the case where you don’t have someone readily available to teach you or a computer science lecture to attend, don’t sit there and wait. Use the internet, there are numerous resources on the web that may even teach you better than a private tutor would. Most professional developers today are self-taught, in fact, <a href=\"https://qz.com/649409/two-out-of-three-developers-are-self-taught-and-other-trends-from-a-survey-of-56033-developers/\">two out of three software developers are self-taught</a>.</p>\n<h2>What you need to get started</h2>\n<p>So now that is out of the way, lets talk about what you need to have in place to start coding right away.</p>\n<p>Although, in truth, the only thing you need to start leaning how to code is any device with Internet connectivity. It doesn’t matter whether it is a mobile phone, a tablet, or a laptop, as long it has Internet access, you can use it to learn how code.</p>\n<p>But I would strongly advice that you get a computer (laptop or desktop), I think this will allow you to learn and get things done faster. For a start, you can get a cheap laptop with minimum specification. You can even rent, or borrow from a friend, if you have to.</p>\n<h2>What you should learn first</h2>\n<ol>\n<li>Start with HTML &#x26; CSS</li>\n<li>Learn Javascript</li>\n<li>Then move forward from there</li>\n</ol>\n<h2>Learning resources</h2>\n<p>The next thing is doing the actual learning. So, below are some online resources that you can use to start learning how to code right away.</p>\n<h4>1. freeCodeCamp</h4>\n<p>FreeCodeCamp is a free online coding school that teaches coding through a well established curriculum. They also give you hands-on experience working on projects for nonprofits.</p>\n<h4>2. Codecademy</h4>\n<p>Codecademy is interactive learning platform that teaches people how to code online. You read a little, type the codes right into the browser, and see results immediately.</p>","timeToRead":2,"frontmatter":{"title":"What you need to start learning how to code","date":"January 01, 2019"}}},"pageContext":{"slug":"/start-coding/","previous":null,"next":null}}