{"data":{"site":{"siteMetadata":{"title":"Vorlume","author":"Salem Nzeukwu"}},"markdownRemark":{"id":"86325ecc-12fe-5519-a757-18dbe6c525b9","excerpt":"In the spirit of new year, I decided to follow  Dan Abramov’s   advice  and  footsteps  to start a blog as soon as possible, something I have procrastinated for…","html":"<p>In the spirit of new year, I decided to follow <a href=\"https://twitter.com/dan_abramov\">Dan Abramov’s</a> <a href=\"https://twitter.com/dan_abramov/status/1079214023881707520\">advice</a> and <a href=\"https://overreacted.io\">footsteps</a> to start a blog as soon as possible, something I have procrastinated for so long.</p>\n<p>People have always asked me what they need to have in place before they can start learning how to code. So it makes sense to start this blog by outlining some prerequisite to learning how to code.</p>\n<p>But before I do that, I want to clear two misconception that people tend to have about coding and learning how to code.</p>\n<ol>\n<li><strong>Codding is not hard:</strong> People always have this misconception that coding is hard. This is not always true. There are times when coding can be challenging. But there are times when it can be fun too. One of the common misconception is that learning how to code requires huge intellectual capabilities.</li>\n</ol>\n<p>However, in honesty – you do not need to be a genius to start learning how to code. All you need to have is motivation, interest, and discipline. Coding can be as fun as learning a new language. Yes, you may find it intimidating at first, but with time you will come to enjoy it.</p>\n<ol start=\"2\">\n<li><strong>You don’t need anyone to teach you:</strong> I have seen many people who say they want to learn how to code, but they don’t actually put in any effort in trying to do that, instead they just sit an wait for someone to come around and teach them or until they attend a computer science lecture. I think this is wrong. You can learn how to code on your own.</li>\n</ol>\n<p>This is not to say that you shouldn’t attend a computer science lecture or get a private tutor to teach you how to code. Do that if you can (it may even help you learn faster). But in the case where you don’t have someone readily available to teach you or a computer science lecture to attend, don’t sit there and wait. Use the internet, there are numerous resources on the web (I will give you a few later in this post), that may even teach you better than a private tutor would. Most professional developers today are self-taught, in fact, <a href=\"https://qz.com/649409/two-out-of-three-developers-are-self-taught-and-other-trends-from-a-survey-of-56033-developers/\">two out of three developers are self-taught</a>.</p>\n<h2>What you need to get started</h2>\n<p>So now that I have cleared those misconceptions, lets talk about what you need to have in place to start learning how to code right away.</p>\n<p>Although, in truth, the only thing you need to start leaning how to code is any device with Internet connectivity. It doesn’t matter whether it is a mobile phone, a tablet, or a laptop, as long it has Internet access, you can use it to learn how to code.</p>\n<p>But I would strongly advice anyone who wants to take coding seriously to get a computer (laptop or desktop), I think this will allow you to learn and get things done faster. For a start, you can get a cheap laptop with minimum specification. You may even rent, or borrow from a friend, if you have to.</p>\n<h2>What you should learn first</h2>\n<p>When choosing to learn how to code, there are so many programming languages to choose from, and there are many different opinions on which language to learn first. This often leaves beginners confused and unsure of where to start from. But I will make it easy for you here:</p>\n<ol>\n<li>Start with HTML and CSS</li>\n<li>Learn Javascript</li>\n<li>Then move forward from there.</li>\n</ol>\n<h2>Learning resources</h2>\n<p>Now that you have what you need and know what to learn first, the next thing is doing the actual learning. So, below are some online resources that you can use to start learning right away. Like I said, there are numerous of these resources online, but I will mention just a couple so I don’t end up overwhelming you.</p>\n<h4>1. <a href=\"https://www.freecodecamp.org\">freeCodeCamp</a></h4>\n<p>FreeCodeCamp is a free online coding school that teaches coding through a well established curriculum. They also give you hands-on experience working on projects for nonprofits.</p>\n<h4>2. <a href=\"https://www.codecademy.com\">Codecademy</a></h4>\n<p>Codecademy is an online interactive learning platform that teaches people how to code. You read a little, type the codes right into the browser, and see results immediately.</p>\n<p>Take a look at these resources, and use anyone that you feel is better for you to start learning immediately.</p>\n<h2>One more thing</h2>\n<p>When you are learning on you own – the process may become boring, and you can easily give up when faced with challenges that comes with learning a new skill. So Find a group of like-minded people, or a community of people who are learning or doing the same thing as you.</p>\n<p>There are communities like <a href=\"https://twitter.com/forLoopAfrica\">@forLoopAfrica</a>, etc. Find them, follow them, and follow their organizers to stay updated on what is happening in the community. Find out when and where they will be holding their next meetup and be sure to be in attendance. You will meet a lot of beginners and experts alike who will motivate you. Ask a lot of questions, and don’t hesitate to share the little you know, for in so doing, you are also learning.</p>\n<p>There are also coding challenges like <a href=\"https://twitter.com/hashtag/100hoursofcode\">100HoursofCode</a>, <a href=\"https://twitter.com/hashtag/100DaysOfCode\">100DaysOfCode</a>, and many others all over the web. Taking part in these challenges can keep you going because you will be motivated to complete the challenges, and you will meet a lot of people around the world who are taking part in the challenges. These people will also keep you motivated in one way or another.</p>\n<h2>In conclusion</h2>\n<p>Coding is not a very difficult skill to learn, you certainly don’t have to be brainy to learn it. You can learn it on you own, and the only thing you need to get started is a laptop (or a mobile phone, if you can’t find a computer) and an internet connection. So now that you know this, don’t let anything else hold you back. Start today. Start now. Make it your new year resolution to learn how to code before the end of the year. And in doing so, you will not only change your life but you may one day change the world.</p>\n<p>That’s all for now.</p>\n<p>Thank you for reading! Please tell someone about Vorlume if you like it, and <a href=\"https://twitter.com/Nzesalem\">tweet at me</a> to give feedback.</p>\n<p>It is with love in my heart that I say <strong>Happy new year!</strong> my friend.</p>","timeToRead":5,"frontmatter":{"title":"What you need to start learning how to code","date":"January 01, 2019"}}},"pageContext":{"slug":"/start-coding/","previous":null,"next":null}}